README.org
#+title: ~map-grid-utils~ package

* Introduction

  This library provides several utility functions and macros on top of
  grid mapping functions ~map-grid~ and ~map-n-grids~ found in Liam
  Healy's ~grid~ package of the ~antik~ library.  They all operate on
  vectors (grid of rank 1), producing (with one exception) vectors.

  These macros and functions are syntactic sugar: they facilitate
  mapping of functions over all vector arguments and mixed rank
  arguments (combinations of vectors and scalars).

  The macros and functions were in part motivated by facilities
  offered by matrix-oriented languages such as IDL (I am not familiar
  with MATLAB's capabilities).  The utilities do not fully mimic their
  syntax.  Instead, I tried to offer adequate functionality while
  conforming to Common Lisp coding and usage conventions.  The symbol
  tagging convention used in the macros is motivated by macros found
  in Doug Hoyte's [[letoverlambda.com][Let Over Lambda]].

  The following table summarizes the macros and functions (F/M refer
  to functions or macros respectively):

  | Name               | Type | CL cousin | Returns   |
  |--------------------+------+-----------+-----------+
  | ~mapgrid~          | F    | ~mapcar~  | Vector    |
  | ~mapg~             | F    | ~mapc~    | First arg |
  | ~mapgrid-ma[-1]~   | M    | -         | Vector    |
  | ~mapgrid-man[-1]~  | M    | -         | Matrix    |

  This library is subject to further improvement and interface
  modifications.  Thus, when using it, it is wise to specify the
  version of the library.
  
* Grid types

  The library operates on CL arrays and ~grid~ foreign-arrays of
  rank 1.  We refer to both types as grids or vectors.  The result
  type is determined by [[id:4fe2plm0etf0][~*default-grid-type*~]].

* Function counterparts to ~mapcar~ and ~mapc~

  ~mapgrid~ and ~mapg~ are direct counterparts to ~mapcar~ and ~mapc~.
  They map a function over their arguments, which are all vectors.

  
* Mapping macros over mixed rank arguments

  Two macro families allow for mapping a function of several arguments
  over a mix of scalars and vectors (we refer to this a mixed rank:
  scalars are of rank 0, vectors of rank 1, and matrices of rank 2).

** ~mapgrid-ma~ or ~mapgrid-ma-1~ macros

   With ~mapgrid-ma~ or ~mapgrid-ma-1~ one can map ~(expt x y)~ for a
   fixed ~x~ and several values of ~y~.  The two macros offer the same
   functionality, but with a slightly different interface, discussed
   below.

** Nested mappings with ~mapgrid-man~ and ~mapgrid-man-1~ macros

   With these macros, the function mapped over two /vectors/ ~grid-0~
   and ~grid-1~ returns a /matrix/.  A matrix element /ij/ is result
   of the function call on /grid-0_i/ and /grid-1_j/.  This kind of
   mapping is not provided by IDL as far as I know.

   The character "n" in the macro name refers to "nested" mapping.

** Interface to mixed-rank mappings

   In IDL, a call to a function ~f(x,y,z)~ can contain a mixture of
   scalars and (congruent) vectors or arrays.  The underlying
   machinery will figure out how to call the function so that it
   returns a result (vector or array) which is a result of mapping
   over successive vector/array elements, keeping scalars constant.

   ~map-grid-utils~ offer a less intelligent user interface: the user
   has to specify which argument is a vector (all other arguments are
   assumed scalars).  Vector arguments are declared by pre-pending "@!",
   "@0", "@1" before the vector names.  The macro code removes these
   prefixes and generates the variable names.  This is discussed next.

