README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>map-grid-utils</code> package</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="<code>map-grid-utils</code> package"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-04 22:18:31 "/>
<meta name="author" content="Mirko Vukovic"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title"><code>map-grid-utils</code> package</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Grid types</a></li>
<li><a href="#sec-3">3 Function counterparts to <code>mapcar</code> and <code>mapc</code></a></li>
<li><a href="#sec-4">4 Mapping macros over mixed kind arguments</a>
<ul>
<li><a href="#sec-4-1">4.1 <code>mapgrid-ma</code> or <code>mapgrid-ma-1</code> macros</a></li>
<li><a href="#sec-4-2">4.2 Nested mappings with <code>mapgrid-man</code> and <code>mapgrid-man-1</code> macros</a></li>
<li><a href="#sec-4-3">4.3 Interface to mixed-kind mappings</a></li>
<li><a href="#sec-4-4">4.4 Specifying mixed-kind mapping arguments</a></li>
</ul>
</li>
<li><a href="#sec-5">5 <code>map-grid-utils</code> dictionary</a>
<ul>
<li><a href="#sec-5-1">5.1 Variable <code>*array-type*</code></a>
<ul>
<li><a href="#sec-5-1-1">5.1.1 Value type</a></li>
<li><a href="#sec-5-1-2">5.1.2 Initial value</a></li>
<li><a href="#sec-5-1-3">5.1.3 Description</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2 Variable <code>*float-type*</code></a>
<ul>
<li><a href="#sec-5-2-1">5.2.1 Value type</a></li>
<li><a href="#sec-5-2-2">5.2.2 Initial value</a></li>
<li><a href="#sec-5-2-3">5.2.3 Description</a></li>
</ul>
</li>
<li><a href="#sec-5-3">5.3 Variables <code>*v1*</code>, <code>*v2*</code>, <code>*v3*</code></a>
<ul>
<li><a href="#sec-5-3-1">5.3.1 Value type</a></li>
<li><a href="#sec-5-3-2">5.3.2 Initial values</a></li>
<li><a href="#sec-5-3-3">5.3.3 Description</a></li>
</ul>
</li>
<li><a href="#sec-5-4">5.4 <code>mapgrid</code>, <code>mapg</code></a>
<ul>
<li><a href="#sec-5-4-1">5.4.1 Syntax</a></li>
<li><a href="#sec-5-4-2">5.4.2 Arguments and Values</a></li>
<li><a href="#sec-5-4-3">5.4.3 Description</a></li>
</ul>
</li>
<li><a href="#sec-5-5">5.5 <code>mapgrid-xa1</code>, <code>mapgrid-xa2</code></a>
<ul>
<li><a href="#sec-5-5-1">5.5.1 Syntax</a></li>
<li><a href="#sec-5-5-2">5.5.2 Arguments and values</a></li>
<li><a href="#sec-5-5-3">5.5.3 Description</a></li>
<li><a href="#sec-5-5-4">5.5.4 Examples</a></li>
</ul>
</li>
<li><a href="#sec-5-6">5.6 <code>mapgrid-man</code>, <code>mapgrid-man-1</code></a>
<ul>
<li><a href="#sec-5-6-1">5.6.1 Syntax</a></li>
<li><a href="#sec-5-6-2">5.6.2 Arguments and values</a></li>
<li><a href="#sec-5-6-3">5.6.3 Description</a></li>
<li><a href="#sec-5-6-4">5.6.4 Examples</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-6">6 Implementation notes</a></li>
<li><a href="#sec-7">7 Todo</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">


<p>
  This library provides several utility functions and macros on top of
  grid mapping functions <code>map-grid</code> and <code>map-n-grids</code> found in Liam
  Healy's <code>grid</code> library.  They all operate on vectors (grid of rank
  1), producing (with one exception) vectors.
</p>
<p>
  These macros and functions are syntactic sugar: they facilitate
  mapping of functions over vector arguments and mixed kind arguments
  (combinations of vectors and scalars).
</p>
<p>
  The macros and functions were in part motivated by facilities
  offered by matrix-oriented languages such as IDL (I am not familiar
  with MATLAB's capabilities).  The utilities do not fully mimic their
  syntax.  Instead, I tried to offer adequate functionality while
  conforming to Common Lisp coding and usage conventions.
</p>
<p>
  The following table summarizes the macros and functions (F/M refer
  to functions or macros respectively):
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Name</th><th scope="col" class="left">Type</th><th scope="col" class="left">CL cousin</th><th scope="col" class="left">Returns</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>mapgrid</code></td><td class="left">F</td><td class="left"><code>mapcar</code></td><td class="left">Vector</td></tr>
<tr><td class="left"><code>mapg</code></td><td class="left">F</td><td class="left"><code>mapc</code></td><td class="left">First arg</td></tr>
<tr><td class="left"><code>mapgrid-ma[-1]</code></td><td class="left">M</td><td class="left">-</td><td class="left">Vector</td></tr>
<tr><td class="left"><code>mapgrid-man[-1]</code></td><td class="left">M</td><td class="left">-</td><td class="left">Matrix</td></tr>
</tbody>
</table>


<p>
  This library is subject to further improvement and interface
  modifications.  Thus, when using it, it is wise to specify the
  version of the library.
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Grid types</h2>
<div class="outline-text-2" id="text-2">


<p>
  The library operates on CL arrays and <code>grid</code> foreign-arrays of
  rank 1.  We refer to both types as grids or vectors.  The result
  type is determined by <a href="#sec-5-1"><code>*array-type*</code></a>.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Function counterparts to <code>mapcar</code> and <code>mapc</code></h2>
<div class="outline-text-2" id="text-3">


<p>
  <code>mapgrid</code> and <code>mapg</code> are direct counterparts to <code>mapcar</code> and <code>mapc</code>.
  They map a function over their arguments, which are all vectors.
</p>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Mapping macros over mixed kind arguments</h2>
<div class="outline-text-2" id="text-4">


<p>
  Two macro families allow for mapping a function of several arguments
  over a mix of scalars and vectors (we refer to this as kinds).
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <code>mapgrid-ma</code> or <code>mapgrid-ma-1</code> macros</h3>
<div class="outline-text-3" id="text-4-1">


<p>
   With <code>mapgrid-ma</code> or <code>mapgrid-ma-1</code> one can map <code>(expt x y)</code> for a
   fixed <code>x</code> and several values of <code>y</code>.  The two macros offer the same
   functionality, but with a slightly different interface, discussed
   below.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Nested mappings with <code>mapgrid-man</code> and <code>mapgrid-man-1</code> macros</h3>
<div class="outline-text-3" id="text-4-2">


<p>
   With these macros, the function mapped over two <i>vectors</i> <code>grid-0</code>
   and <code>grid-1</code> returns a <i>matrix</i>.  A matrix element <i>ij</i> is result
   of the function call on <i>grid-0<sub>i</sub></i> and <i>grid-1<sub>j</sub></i>.  Again
   <code>mapgrid-man</code> and <code>mapgrid-man-1</code> offer the same functionality but
   with a slightly different interface.  This kind of mapping is not
   provided by IDL as far as I know.
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Interface to mixed-kind mappings</h3>
<div class="outline-text-3" id="text-4-3">


<p>
   In IDL, a call to a function <code>f(x,y,z)</code> can contain a mixture of
   scalars and (congruent) vectors or arrays.  The underlying
   machinery will figure out how to call the function so that it
   returns a result (vector or array) which is a result of mapping
   over successive vector/array elements, keeping scalars constant.
</p>
<p>
   <code>map-grid-utils</code> offer a less intelligent user interface: the user
   has to specify which argument is a vector (all other arguments are
   assumed scalars).  Vector arguments are declared by pre-pending "@!",
   "@0", "@1" before the vector names.  The macro code removes these
   prefixes and generates the variable names.  This is discussed next.
</p>
</div>

</div>
