README.org
** Specifying mixed-rank mapping arguments

   We restrict whether the arguments are variables or s-expressions.
   The following discussion uses ~mapgrid-ma[-1]~ as example, but
   applies to ~mapgrid-man[-1]~ as well.

   ~mapgrid-man~ only accepts symbols that evaluate to variables, and
   is used as follows:
   #+BEGIN_SRC lisp
	(mapgrid-man #'foo a @!b c @!d)
   #+END_SRC
   Here ~a~ and ~d~ are scalar variables or s-expressions and ~b~ and
   ~d~ are congruent vectors (of same length)

   If we wanted to use s-expressions instead of vectors, we would
   instead use ~mapgrid-man-1~:
   #+BEGIN_SRC lisp
     (mapgrid-man-1 (foo a @!b c @!d) (s-expr1 ...) (s-expr2 ...))
   #+END_SRC
   Here ~@!b~ and ~@!d~ are placeholders to be filled with the results
   of s-expressions.

   Since ~mapgrid-ma1,2~ map over vectors in parallel we specify all the
   vectors with "@!".  But for the nested mapping, we need to specify
   which argument varies along the matrix row, and which over the matrix
   column.  We use "@0" for the argument that varies along rows and
   "@1" for the argument that varies along the column.  So the two
   calls
   #+BEGIN_SRC lisp
	(mapgrid-man #'foo @0x y @1z)
	(mapgrid-man #'foo @1x y @0z)
   #+END_SRC
   produce results that are transpose of each other.

   
   Scalar arguments must always be variables, never s-expressions.
   This restriction may be removed in the future.
   

   
* ~map-grid-utils~ dictionary

** Variable ~*default-grid-type*~
   :PROPERTIES:
   :ID:       4fe2plm0etf0
   :END:
   
*** Value type
    a symbol

*** Initial value
    'cl:array

*** Description
    :PROPERTIES:
    :ID:       8if9yrn0ltf0
    :END:
    The value of ~*default-grid-type*~ has effect on the type of vector that
    ~mapgrid~ and ~mapg~ will return.  The allowed values are:
    - 'cl:array -- return a common-lisp vector or array
    - 'grid:foreign-array -- a foreign array

** Variable ~*default-element-type*~
   :PROPERTIES:
   :ID:       wughcmm0etf0
   :END:

*** Value type
    a symbol

*** Initial value
    'DOUBLE-FLOAT

*** Description
    The value of ~*default-element-type*~ has effect on the type of float that
    vectors created by ~mapgrid~ and ~mapg~ will contain.  The allowed
    values are
    - t -- any type
    - 'float -- a single float
    - 'double-float -- a double float

      
    The 'double-float type is mandatory for vectors that will be used as
    arguments to GSLL's functions.
    
** Variables ~*v1*~, ~*v2*~, ~*v3*~

*** Value type
    - grid vectors

*** Initial values
    - ~*v1*~ :: A vector containing [0d0 1d0 2d 3d0]
    - ~*v2*~ :: A vector containing [10d0 11d0 12d0 13d0]
    - ~*v3*~ :: A vector containing [1d0 2d0]
      
      
    The vector type (~array~ or ~grid:foreign-array~) depends on the value
    stored in ~*default-grid-type*~.

*** Description
    Variables used for testing and examples.  They are /not/ exported.
    
** ~mapgrid~, ~mapg~
*** Syntax
    - *mapgrid* function &rest vectors+ => result-vector
    - *mapg* function &rest vectors+ => vector-1
*** Arguments and Values
    - /function/ -- a function designator or a lambda expression that
      takes as many arguments as there are vectors
    - /vector/ -- either Common Lisp or grid vector
    - /result-vector/ -- a Common Lisp or grid vector
    
*** Description
    The mapping operation involves applying function to successive
    sets of arguments in which one argument is obtained from each
    vector.

    ~mapgrid~ accumulates the results into a vector. 

    ~mapg~ returns the first vector.  It is intended for side effects of
    the function calls.

    The function call results are coerced to [[id:wughcmm0etf0][~*default-element-type*~]].

    The vector type is determined by [[id:4fe2plm0etf0][~*default-grid-type*~]].

** ~mapgrid-xa1~, ~mapgrid-xa2~

*** Syntax
    - (*mapgrid-ma* function &rest arguments1) => result-vector
    - (*mapgrid-ma-1* (function &rest arguments2) &rest vectors) => result-vector

*** Arguments and values
    - /function/ -- a function designator or a lambda expression
    - /arguments1/ -- combination of scalars and vectors, vectors being marked with a
      @! prefix
    - /arguments2/ -- scalars or dummy symbols prefixed by @!
    - /vectors/ -- one or more grid vectors
    - /result-vector/ -- a grid vector

*** Description
    The macros map ~function~ over vectors.  At each call, the
    function's arguments are constructed from the scalar arguments and
    successive vector elements.

    The user tags the vectors to the macros by pre-pending the ~@!~
    prefix before each symbol name.

    ~arguments1~ and ~arguments2~ cannot have s-expressions.  All
    arguments must be existing variables.  S-expressions can be used
    as part of the ~vectors~ argument to ~mapgrid-ma~.

