README.html

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Specifying mixed-kind mapping arguments</h3>
<div class="outline-text-3" id="text-4-4">


<p>
   We restrict whether the arguments are variables or s-expressions.
   The following discussion uses <code>mapgrid-ma[-1]</code> as example, but
   applies to <code>mapgrid-man[-1]</code> as well.
</p>
<p>
   <code>mapgrid-man</code> only accepts symbols that evaluate to variables, and
   is used as follows:
</p>


<pre class="src src-lisp">(mapgrid-man #'foo a @!b c @!d)
</pre>

<p>
   Here <code>a</code> and <code>d</code> are scalar variables or s-expressions and <code>b</code> and
   <code>d</code> are congruent vectors.
</p>
<p>
   If we wanted to use s-expressions instead of vectors, we would
   instead use <code>mapgrid-man-1</code>:
</p>


<pre class="src src-lisp">(mapgrid-man-1 (foo a @!b c @!d) (s-expr1 ...) (s-expr2 ...))
</pre>

<p>
   Here <code>@!b</code> and <code>@!d</code> are placeholders to be filled with the results
   of s-expressions.
</p>
<p>
   Since <code>mapgrid-ma1,2</code> map over vectors in parallel we specify all the
   vectors with "@!".  But for the nested mapping, we need to specify
   which argument varies along the matrix row, and which over the matrix
   column.  We use "@0" for the argument that varies along rows and
   "@1" for the argument that varies along the column.  So the two
   calls
</p>


<pre class="src src-lisp">(mapgrid-man #'foo @0x y @1z)
(mapgrid-man #'foo @1x y @0z)
</pre>

<p>
   produce results that are transpose of each other.
</p>

<p>   
   Scalar arguments must always be variables, never s-expressions.
</p>



</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <code>map-grid-utils</code> dictionary</h2>
<div class="outline-text-2" id="text-5">



</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><a name="4fe2plm0etf0" id="4fe2plm0etf0"></a><span class="section-number-3">5.1</span> Variable <code>*array-type*</code></h3>
<div class="outline-text-3" id="text-5-1">



</div>

<div id="outline-container-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Value type</h4>
<div class="outline-text-4" id="text-5-1-1">

<p>    a symbol
</p>
</div>

</div>

<div id="outline-container-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> Initial value</h4>
<div class="outline-text-4" id="text-5-1-2">

<p>    'array
</p>
</div>

</div>

<div id="outline-container-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><a name="8if9yrn0ltf0" id="8if9yrn0ltf0"></a><span class="section-number-4">5.1.3</span> Description</h4>
<div class="outline-text-4" id="text-5-1-3">

<p>    The value of <code>*array-type*</code> has effect on the type of vector that
    <code>mapgrid</code> and <code>mapg</code> will return.  The allowed values are:
</p><ul>
<li>'array &ndash; return a common-lisp vector or array
</li>
<li>'grid:foreign-array &ndash; a foreign array
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><a name="wughcmm0etf0" id="wughcmm0etf0"></a><span class="section-number-3">5.2</span> Variable <code>*float-type*</code></h3>
<div class="outline-text-3" id="text-5-2">



</div>

<div id="outline-container-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> Value type</h4>
<div class="outline-text-4" id="text-5-2-1">

<p>    a symbol
</p>
</div>

</div>

<div id="outline-container-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> Initial value</h4>
<div class="outline-text-4" id="text-5-2-2">

<p>    'DOUBLE-FLOAT
</p>
</div>

</div>

<div id="outline-container-5-2-3" class="outline-4">
<h4 id="sec-5-2-3"><span class="section-number-4">5.2.3</span> Description</h4>
<div class="outline-text-4" id="text-5-2-3">

<p>    The value of <code>*float-type*</code> has effect on the type of float that
    vectors created by <code>mapgrid</code> and <code>mapg</code> will contain.  The allowed
    values are
</p><ul>
<li>t &ndash; any type
</li>
<li>'float &ndash; a single float
</li>
<li>'double-float &ndash; a double float
</li>
</ul>



<p>      
    The 'double-float type is mandatory for vectors that will be used as
    arguments to GSLL's functions.
</p>
</div>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Variables <code>*v1*</code>, <code>*v2*</code>, <code>*v3*</code></h3>
<div class="outline-text-3" id="text-5-3">



</div>

<div id="outline-container-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> Value type</h4>
<div class="outline-text-4" id="text-5-3-1">

<ul>
<li>grid vectors
</li>
</ul>


</div>

</div>

<div id="outline-container-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> Initial values</h4>
<div class="outline-text-4" id="text-5-3-2">

<dl>
<dt><code>*v1*</code></dt><dd>A vector containing [0d0 1d0 2d 3d0]
</dd>
<dt><code>*v2*</code></dt><dd>A vector containing [10d0 11d0 12d0 13d0]
</dd>
<dt><code>*v3*</code></dt><dd>A vector containing [1d0 2d0]
</dd>
</dl>



<p>      
    The vector type (<code>array</code> or <code>grid:foreign-array</code>) depends on the value
    stored in <code>*array-type*</code>.
</p>
</div>

</div>

<div id="outline-container-5-3-3" class="outline-4">
<h4 id="sec-5-3-3"><span class="section-number-4">5.3.3</span> Description</h4>
<div class="outline-text-4" id="text-5-3-3">

<p>    Variables used for testing and examples.  They are <i>not</i> exported.
</p>
</div>
</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> <code>mapgrid</code>, <code>mapg</code></h3>
<div class="outline-text-3" id="text-5-4">


</div>

<div id="outline-container-5-4-1" class="outline-4">
<h4 id="sec-5-4-1"><span class="section-number-4">5.4.1</span> Syntax</h4>
<div class="outline-text-4" id="text-5-4-1">

<ul>
<li><b>mapgrid</b> function &amp;rest vectors+ =&gt; result-vector
</li>
<li><b>mapg</b> function &amp;rest vectors+ =&gt; vector-1
</li>
</ul>

</div>

</div>

<div id="outline-container-5-4-2" class="outline-4">
<h4 id="sec-5-4-2"><span class="section-number-4">5.4.2</span> Arguments and Values</h4>
<div class="outline-text-4" id="text-5-4-2">

<ul>
<li><i>function</i> &ndash; a function designator or a lambda expression that
      takes as many arguments as there are vectors
</li>
<li><i>vector</i> &ndash; either Common Lisp or grid vector
</li>
<li><i>result-vector</i> &ndash; a Common Lisp or grid vector
</li>
</ul>


</div>

</div>

<div id="outline-container-5-4-3" class="outline-4">
<h4 id="sec-5-4-3"><span class="section-number-4">5.4.3</span> Description</h4>
<div class="outline-text-4" id="text-5-4-3">

<p>    The mapping operation involves applying function to successive
    sets of arguments in which one argument is obtained from each
    vector.
</p>
<p>
    <code>mapgrid</code> accumulates the results into a vector. 
</p>
<p>
    <code>mapg</code> returns the first vector.  It is intended for side effects of
    the function calls.
</p>
<p>
    The function call results are coerced to <a href="#sec-5-2"><code>*float-type*</code></a>.
</p>
<p>
    The vector type is determined by <a href="#sec-5-1"><code>*array-type*</code></a>.
</p>
</div>
</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> <code>mapgrid-xa1</code>, <code>mapgrid-xa2</code></h3>
<div class="outline-text-3" id="text-5-5">



</div>

<div id="outline-container-5-5-1" class="outline-4">
<h4 id="sec-5-5-1"><span class="section-number-4">5.5.1</span> Syntax</h4>
<div class="outline-text-4" id="text-5-5-1">

<ul>
<li>(<b>mapgrid-ma</b> function &amp;rest arguments1) =&gt; result-vector
</li>
<li>(<b>mapgrid-ma-1</b> (function &amp;rest arguments2) &amp;rest vectors) =&gt; result-vector
</li>
</ul>


</div>

</div>

<div id="outline-container-5-5-2" class="outline-4">
<h4 id="sec-5-5-2"><span class="section-number-4">5.5.2</span> Arguments and values</h4>
<div class="outline-text-4" id="text-5-5-2">

<ul>
<li><i>function</i> &ndash; a function designator or a lambda expression
</li>
<li><i>arguments1</i> &ndash; combination of scalars and vectors, vectors being marked with a
      @! prefix
</li>
<li><i>arguments2</i> &ndash; scalars or dummy symbols prefixed by @!
</li>
<li><i>vectors</i> &ndash; one or more grid vectors
</li>
<li><i>result-vector</i> &ndash; a grid vector
</li>
</ul>


</div>

</div>

<div id="outline-container-5-5-3" class="outline-4">
<h4 id="sec-5-5-3"><span class="section-number-4">5.5.3</span> Description</h4>
<div class="outline-text-4" id="text-5-5-3">

<p>    The macros map <code>function</code> over vectors.  At each call, the
    function's arguments are constructed from the scalar arguments and
    successive vector elements.
</p>
<p>
    The user tags the vectors to the macros by pre-pending the <code>@!</code>
    prefix before each symbol name.
</p>
<p>
    <code>arguments1</code> and <code>arguments2</code> cannot have s-expressions.  All
    arguments must be existing variables.  S-expressions can be used
    as part of the <code>vectors</code> argument to <code>mapgrid-ma</code>.
</p>
</div>

</div>
