README.org
*** Examples
    A couple examples using lists may explain the macros better

    #+BEGIN_SRC lisp
(mapgrid-ma #'expt 5d0 @!*V1*)
    #+END_SRC
    => #m[1d0 5d0 25d0 125d0]

    is equivalent to (using lists instead of grids)
    #+BEGIN_SRC lisp
      (mapcar (lambda (arg)
                (expt 5d0 arg))
              '(0d0 1d0 2d0 3d0))
    #+END_SRC

    #+BEGIN_SRC lisp
(mapgrid-ma-1 (expt @!a @!b) *V1* *V0*)
    #+END_SRC
    => #m[0d0 11d0 144d0 2197d0]
    is equivalent to
    #+BEGIN_SRC lisp
      (mapcar (lambda (x1 x0)
                (expt x1 x2))
              '(10d0 11d0 12d0 13d0)
              ('0d0 1d0 2d0 3d0))    
    #+END_SRC

    Now suppose that we did not have *v1* but had an s-expression
    instead.  Then, we cannot use ~mapgrid-ma~, but must use
    ~mapgrid-ma-1~
    #+BEGIN_SRC lisp
      (mapgrid-man-1 (expt 5d0 @!v1)
                   (make-grid `((,*default-grid-type* 4) ,*default-element-type*)
                              :initial-contents '(0d0 1d0 2d0 3d0)))
    #+END_SRC

    

** ~mapgrid-man~, ~mapgrid-man-1~
*** Syntax
    - (*mapgrid-man* function &rest arguments) => result-vector
    - (*mapgrid-man-1* (function &rest arguments) &rest vectors) =>
      result-vector


*** Arguments and values
    - /function/ -- a function designator or a lambda form
    - /arguments/ -- a mixture of scalars and two vectors, the vectors
      being marked with a @0 and @1 prefixes
    - /result-vector/ -- a Common Lisp or grid matrix

*** Description
    ~mapgrid-man~, ~mapgrid-man-1~ performs a nested mapping with the
    results stored in a matrix.  The first matrix row is obtained by
    mapping the function over the @1 labeled vector, taking the remaining
    arguments from the scalars, and first element of the @0 vector.
    The following rows is obtained by repeating this scan, but in
    successive scans taking successive elements of the @1 vector.

    /Arguments/ cannot be forms that evaluate into a scalar or vector.
    They must be symbols whose value is a scalar or a vector.  

*** Examples

    The following examples show calls of functions that require only
    two arguments, and both are vectors:
    
    #+BEGIN_SRC lisp
(mapgrid-man (expt @0*v2* @1*V3*))
    #+END_SRC
    => #2A((10d0 11d0 12d0 13d0)
    (100d0 121d0 144d0 169d0))
    

    #+BEGIN_SRC lisp
(mapgrid-man (expt @1*V2* @0*v3*))
    #+END_SRC
    => #2A((10d0 100d0)
    (11d0 121d0)
    (12d0 144d0)
    (13d0 169d0))

    The macro can handle calls of mixed arguments, such as
    #+BEGIN_SRC lisp
(mapgrid-man (foo @0*v2* bar @1*V3*))
    #+END_SRC
    where ~bar~ evaluates to a scalar.
    


* Implementation notes

  The philosophy was to take as much of the calling and documentation
  conventions from Common Lisp and hyperspec as possible.

  The variable tagging is from Doug Hoyte's [[http://letoverlambda.com][Let over Lambda]] book.

  ~lisp-unit~ is used for function tests.  Almost all functions have
  tests associated with them.  These tests also serve as documentation
  regarding the function usage.  

  

* Todo
  - Implement functionality to return compiled functions that will
    accept mixed-rank arguments
  - Investigate usage of the ~once-only~ macro to process scalar
    arguments in the mixed argument macros.
  - Clean-up code.  Some of it may contained remains of old
    development.
  - Investigate how to allow s-expressions as arguments to mapping
    macros
