README.html

<div id="outline-container-5-5-4" class="outline-4">
<h4 id="sec-5-5-4"><span class="section-number-4">5.5.4</span> Examples</h4>
<div class="outline-text-4" id="text-5-5-4">

<p>    A couple examples using lists may explain the macros better
</p>



<pre class="src src-lisp">(mapgrid-ma #'expt 5d0 @!*V1*)
</pre>

<p>
    =&gt; #m[1d0 5d0 25d0 125d0]
</p>
<p>
    is equivalent to (using lists instead of grids)
</p>


<pre class="src src-lisp">(mapcar (<span style="color: #728a05;">lambda</span> (arg)
          (expt 5d0 arg))
        '(0d0 1d0 2d0 3d0))
</pre>



<pre class="src src-lisp">(mapgrid-ma-1 (expt @!a @!b) *V1* *V0*)
</pre>

<p>
    =&gt; #m[0d0 11d0 144d0 2197d0]
    is equivalent to
</p>


<pre class="src src-lisp">(mapcar (<span style="color: #728a05;">lambda</span> (x1 x0)
          (expt x1 x2))
        '(10d0 11d0 12d0 13d0)
        ('0d0 1d0 2d0 3d0))    
</pre>


<p>
    Now suppose that we did not have <b>v1</b> but had an s-expression
    instead.  Then, we cannot use <code>mapgrid-ma</code>, but must use
    <code>mapgrid-ma-1</code>
</p>


<pre class="src src-lisp">(mapgrid-ma-1 (expt 5d0 @!v1)
             (make-grid `((,*array-type* 4) ,*float-type*)
                        <span style="color: #728a05;">:initial-contents</span> '(0d0 1d0 2d0 3d0)))
</pre>




</div>
</div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> <code>mapgrid-man</code>, <code>mapgrid-man-1</code></h3>
<div class="outline-text-3" id="text-5-6">


</div>

<div id="outline-container-5-6-1" class="outline-4">
<h4 id="sec-5-6-1"><span class="section-number-4">5.6.1</span> Syntax</h4>
<div class="outline-text-4" id="text-5-6-1">

<ul>
<li>(<b>mapgrid-man</b> function &amp;rest arguments) =&gt; result-vector
</li>
<li>(<b>mapgrid-man-1</b> (function &amp;rest arguments) &amp;rest vectors) =&gt;
      result-vector
</li>
</ul>



</div>

</div>

<div id="outline-container-5-6-2" class="outline-4">
<h4 id="sec-5-6-2"><span class="section-number-4">5.6.2</span> Arguments and values</h4>
<div class="outline-text-4" id="text-5-6-2">

<ul>
<li><i>function</i> &ndash; a function designator or a lambda form
</li>
<li><i>arguments</i> &ndash; a mixture of scalars and two vectors, the vectors
      being marked with a @0 and @1 prefixes
</li>
<li><i>result-vector</i> &ndash; a Common Lisp or grid matrix
</li>
</ul>


</div>

</div>

<div id="outline-container-5-6-3" class="outline-4">
<h4 id="sec-5-6-3"><span class="section-number-4">5.6.3</span> Description</h4>
<div class="outline-text-4" id="text-5-6-3">

<p>    <code>mapgrid-man</code>, <code>mapgrid-man-1</code> performs a nested mapping with the
    results stored in a matrix.  The first matrix row is obtained by
    mapping the function over the @1 labeled vector, taking the remaining
    arguments from the scalars, and first element of the @0 vector.
    The following rows is obtained by repeating this scan, but in
    successive scans taking successive elements of the @1 vector.
</p>
<p>
    <i>Arguments</i> cannot be forms that evaluate into a scalar or vector.
    They must be symbols whose value is a scalar or a vector.  
</p>
</div>

</div>

<div id="outline-container-5-6-4" class="outline-4">
<h4 id="sec-5-6-4"><span class="section-number-4">5.6.4</span> Examples</h4>
<div class="outline-text-4" id="text-5-6-4">


<p>
    The following examples show calls of functions that require only
    two arguments, and both are vectors:
</p>



<pre class="src src-lisp">(mapgrid-man (expt @0*v2* @1*V3*))
</pre>

<p>
    =&gt; #m2[[10d0 11d0 12d0 13d0]
    [100d0 121d0 144d0 169d0]
</p>




<pre class="src src-lisp">(mapgrid-man (expt @1*V2* @0*v3*))
</pre>

<p>
    =&gt; #m[[10d0 100d0
    [11d0 121d0]
    [12d0 144d0]
    [13d0 169d0]]
</p>
<p>
    The macro can handle calls of mixed arguments, such as
</p>


<pre class="src src-lisp">(mapgrid-man (foo @0*v2* bar @1*V3*))
</pre>

<p>
    where <code>bar</code> evaluates to a scalar.
</p>


</div>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Implementation notes</h2>
<div class="outline-text-2" id="text-6">


<p>
  The philosophy was to take as much of the calling and documentation
  conventions from Common Lisp and hyperspec as possible.
</p>
<p>
  <code>lisp-unit</code> is used for function tests.  Almost all functions have
  tests associated with them.  These tests also serve as documentation
  regarding the function usage.  
</p>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Todo</h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>Implement functionality to return compiled functions that will
    accept mixed-kind arguments
</li>
<li>Investigate usage of the <code>once-only</code> macro to process scalar
    arguments in the mixed argument macros.
</li>
<li>Clean-up code.  Some of it may contained remains of old
    development.
</li>
<li>Investigate how to allow s-expressions as arguments to mapping
    macros
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-04 22:18:31 </p>
<p class="author">Author: Mirko Vukovic</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
